# Do not edit this file in ~/.config/homebrew/Brewfile. Edit the version in chezmoi source.
#

tap "fluxcd/tap"

brew "age"
brew "atuin"
brew "chezmoi"
brew "coreutils"
brew "direnv"
brew "findutils"
brew "gnu-sed"
brew "go"
brew "go-task"
brew "jq"
brew "pre-commit"
brew "prettier"
brew "pwgen"
brew "sops"
brew "starship"
brew "tmux"
brew "wget"
brew "yamllint"
brew "yq"
brew "zsh"

brew "k9s"
brew "krew"
brew "kubernetes-cli"
brew "talosctl"
brew "talhelper"
brew "helm"
brew "helmfile"
brew "opentofu"

{{ if (eq .chezmoi.os "darwin") }}
brew "mas"
brew "telnet"
cask "1password"
cask "1password-cli"
cask "appcleaner"
cask "balenaetcher"
cask "brave-browser"
cask "coconutbattery"
cask "discord"
cask "iina"
cask "keka"
cask "orbstack"
cask "orion"
cask "owncloud"
cask "signal"
cask "suspicious-package"
cask "telegram"
cask "textmate"
cask "visual-studio-code"
cask "font-fira-code-nerd-font"

{{- if .workMachine }}
brew "awscli"
brew "eks-node-viewer"
brew "git-crypt"
brew "terraform-docs"
cask "aws-vpn-client"
cask "google-chrome"
cask "gpg-suite-no-mail"
cask "session-manager-plugin"
{{- end }}

mas "Brother iPrint&Scan", id: 1193539993
mas "Discovery", id: 1381004916
mas "Faktura", id: 650567365
mas "Velja", id: 1607635845
mas "WiFi Explorer", id: 494803304
mas "Windows App", id: 1295203466
mas "WireGuard", id: 1451685025

{{ end }}