# Do not edit this file in ~/.config/homebrew/Brewfile. Edit the version in chezmoi source.
#

tap "fluxcd/tap"

brew "age"
brew "atuin"
brew "chezmoi"
brew "coreutils"
brew "direnv"
brew "findutils"
brew "gnu-sed"
brew "git"
brew "git-delta"
brew "go"
brew "go-task"
brew "inetutils"
brew "jq"
brew "pre-commit"
brew "prettier"
brew "pwgen"
brew "sops"
brew "starship"
brew "tmux"
brew "wget"
brew "yamllint"
brew "yq"
brew "zsh"

brew "k9s"
brew "krew"
brew "kubernetes-cli"
brew "talosctl"
brew "talhelper"
brew "helm"
brew "helm-docs"
brew "helm-ls"
brew "helmfile"
brew "opentofu"
brew "fluxcd/tap/flux"

{{ if (eq .chezmoi.os "darwin") }}
# brew "mas"
cask "1password"
cask "1password-cli"
cask "appcleaner"
cask "balenaetcher"
cask "bettermouse"
cask "brave-browser"
cask "coconutbattery"
cask "discord"
cask "iina"
cask "keka"
cask "orbstack"
cask "orion"
cask "owncloud"
cask "signal"
cask "suspicious-package"
cask "telegram"
cask "textmate"
cask "visual-studio-code"
cask "font-fira-code-nerd-font"
cask "zed"

{{- if .workMachine }}
tap "aws/tap"
brew "awscli"
brew "aws/tap/eks-node-viewer"
brew "git-crypt"
brew "gpg"
brew "terraform-docs"
cask "aws-vpn-client"
cask "session-manager-plugin"
cask "slack"
{{- end }}

#  mas "Brother iPrint&Scan", id: 1193539993
#  mas "Discovery", id: 1381004916
#  mas "Faktura", id: 650567365
#  mas "Velja", id: 1607635845
#  mas "WiFi Explorer", id: 494803304
#  mas "Windows App", id: 1295203466
#  mas "WireGuard", id: 1451685025

## VS Code extensions grouped by category

### Language support
vscode "golang.go"
vscode "redhat.vscode-yaml"
vscode "mrmlnc.vscode-json5"
vscode "tamasfe.even-better-toml"
vscode "opentofu.vscode-opentofu"

### Formatters & linters
vscode "esbenp.prettier-vscode"
vscode "fcrespo82.markdown-table-formatter"
vscode "foxundermoon.shell-format"

### Themes / Appearance
vscode "arcticicestudio.nord-visual-studio-code"
vscode "file-icons.file-icons"
vscode "oderwat.indent-rainbow"

### Productivity / Navigation
vscode "fabiospampinato.vscode-projects-plus"
vscode "ms-vscode.atom-keybindings"
vscode "britesnow.vscode-toggle-quotes"
vscode "usernamehw.errorlens"
vscode "aaron-bond.better-comments"

### DevOps / Infra / Secrets

vscode "signageos.signageos-vscode-sops"
vscode "mikestead.dotenv"

### Source control & misc
vscode "donjayamanne.githistory"

{{ end }}
